{
  "serviceName": "Cynnig cynllun trefniant plentyn",
  "back": "Yn ôl",
  "continue": "Parhau",
  "notSafe": {
    "title": "Dod o hyd i'r llwybr cywir i chi",
    "warningText": "Os ydych mewn perygl uniongyrchol, ffoniwch 999 a gofynnwch am yr heddlu.",
    "warningIconFallback": "Rhybudd",
    "content": "<p><a href=\"https://www.gov.uk/guidance/domestic-abuse-how-to-get-help#recognise-domestic-abuse\">Darganfyddwch sut i adnabod cam-drin domestig</a>.</p><p><a href=\"https://www.citizensadvice.org.uk/family/making-agreements-about-your-children/making-child-arrangements\">Cael cymorth a chyngor ar wneud trefniadau plant pan fu cam-drin domestig</a>.</p>",
    "continue": "Os ydych chi'n teimlo'n hyderus y gallwch barhau heb unrhyw berygl i chi'ch hun na'r plant, parhewch i ddefnyddio'r gwasanaeth.",
    "intro": "<p>Efallai na fydd y gwasanaeth hwn yn iawn i chi os ydych wedi profi cam-drin domestig.</p>",
    "continueTitle": "Os ydych am barhau",
    "escapeKeyAnnouncement": "Os oes angen i chi adael y dudalen hon yn gyflym, gwasgwch y botwm Escape ar eich bysellfwrdd."
  },
  "childrenNotSafe": {
    "title": "Cael cymorth",
    "warningText": "Os ydych mewn perygl uniongyrchol, ffoniwch 999 a gofynnwch am yr heddlu.",
    "warningIconFallback": "Rhybudd",
    "content": "<p><a href=\"https://www.nspcc.org.uk/keeping-children-safe/types-of-abuse/domestic-abuse/?ac=221274\">Cael cyngor ar Sut i Amddiffyn Plant Rhag Cam-drin Domestig | NSPCC</a>.</p><p><a href=\"https://www.citizensadvice.org.uk/family/making-agreements-about-your-children/making-child-arrangements/\">Mae gan Cyngor ar Bopeth gyngor ar wneud trefniadau plant pan fu cam-drin domestig</a>.</p>",
    "continue": "Os ydych chi'n teimlo'n hyderus y gallwch barhau heb unrhyw berygl i chi'ch hun na'r plant, parhewch i ddefnyddio'r gwasanaeth.",
    "intro": "<p>Efallai na fydd yn briodol gwneud trefniadau plant os oes unrhyw risg o niwed i'r plant.</p>",
    "continueTitle": "Os ydych am barhau",
    "escapeKeyAnnouncement": "Os oes angen i chi adael y dudalen hon yn gyflym, gwasgwch y botwm Escape ar eich bysellfwrdd."
  },
  "phaseBannerText": "Mae hwn yn wasanaeth newydd. Helpwch ni i'w wella a <a href={{ feedbackUrl }} target=\"_blank\" rel=\"noopener noreferrer\">rhowch eich adborth (yn agor mewn tab newydd)</a>.",
  "accessibilityStatement": {
    "title": "Datganiad hygyrchedd",
    "appliesTo": "Mae'r datganiad hygyrchedd hwn yn berthnasol i'r gwasanaeth Cynnig cynllun trefniadau plant.",
    "usableToAsManyAsPossible": "Y Weinyddiaeth Gyfiawnder sy'n gyfrifol am y wefan hon. Rydym eisiau i gymaint o bobl â phosibl allu defnyddio'r wefan hon. Er enghraifft, golyga hyn y dylech allu:",
    "changeColours": "newid y lliwiau, y lefelau cyferbyniad a'r ffontiau gan ddefnyddio gosodiadau'r porwr neu'r ddyfais",
    "zoomIn": "gwneud y testun hyd at 400% yn fwy heb iddo ddiflannu oddi ar y sgrin",
    "speechRecognition": "mynd drwy'r rhan fwyaf o'r wefan gan ddefnyddio bysellfwrdd neu feddalwedd adnabod llais",
    "screenReader": "gwrando ar y rhan fwyaf o'r wefan gan ddefnyddio darllenydd sgrin (gan gynnwys fersiynau diweddaraf JAWS, NVDA a VoiceOver)",
    "simpleToUnderstand": "Rydym hefyd wedi gwneud testun y wefan mor syml â phosibl i'w ddeall.",
    "abilityNet": "Mae gan Ability Net gyngor ynghylch gwneud eich dyfais yn haws i'w defnyddio os oes gennych anabledd.",
    "htmlVersion": "Mae yna hefyd fersiwn HTML o'r datganiad hwn.",
    "this": "Mae hwn yn cynnwys:",
    "interactive": "hyperddolenni rhyngweithiol, y gellir clicio arnynt",
    "offline": "gellir agor mewn unrhyw borwr gwe all-lein",
    "screenReaderSupport": "gweithio gyda darllenwyr sgrîn",
    "howAccessible": "Pa mor hygyrch yw'r wefan hon",
    "notFullyAccessible": "Nid yw'r datganiad hygyrchedd yn gwbl hygyrch:",
    "knownIssues": [
      "Gall defnyddiwr darllenydd sgrin ei chael hi'n anodd gyda rhai o'r dolenni",
      "Bydd defnyddwyr darllenydd sgrin yn ei chael yn anodd cael mynediad i'r PDF wedi'i allgludo",
      "gall defnyddwyr darllenydd sgrin ei chael yn anodd rhyngweithio gyda rhai o'r botymau ar y dudalen"
    ],
    "feedbackContact": "Adborth a gwybodaeth gyswllt",
    "reportProblems": "Os byddwch yn cael unrhyw broblemau nad ydynt wedi'u cynnwys ar y dudalen hon, neu'n credu nad ydym yn bodloni'r gofynion o ran hygyrchedd, cysylltwch gyda: {{ contactEmail }}",
    "alternativeFormats": "Os ydych angen gwybodaeth sydd ar y wefan hon mewn fformat arall megis ar ffurf PDF hygyrch, print bras, fformat hawdd ei ddeall, recordiad sain neu braille:",
    "email": "E-bostiwch {{{ contactEmail }}}",
    "responseTime": "Byddwn yn ystyried eich cais ac yn ymateb o fewn 5 diwrnod gwaith.",
    "enforcementProcedure": "Y Weithdrefn Orfodi",
    "equalityCommission": "Y Comisiwn Cydraddoldeb a Hawliau Dynol (EHRC) sy'n gyfrifol am orfodi Rheoliadau Hygyrchedd Cyrff y Sector Cyhoeddus (Gwefannau a Rhaglenni Symudol) (Rhif 2) 2018 (y 'rheoliadau hygyrchedd'). Os nad ydych chi'n fodlon gyda'r ffordd rydym yn ymateb i'ch cwyn, cysylltwch â'r Gwasanaeth Cynghori a Chymorth Cydraddoldeb (EASS)",
    "technicalInfo": "Gwybodaeth dechnegol am hygyrchedd y wefan hon",
    "commitment": "Mae'r Weinyddiaeth Gyfiawnder wedi ymrwymo i sicrhau bod ei wefan yn hygyrch, a hynny yn unol â Rheoliadau Hygyrchedd Cyrff y Sector Gyhoeddus (Gwefannau a Rhaglenni Symudol) (Rhif 2) 2018.",
    "complianceStatus": "Statws cydymffurfiaeth",
    "wcagStandard": "Mae'r wefan hon yn cydymffurfio'n llawn â'r Canllawiau Hygyrchedd Cynnwys Gwe fersiwn 2.2 safon AA.",
    "partialCompliance": "Mae'r wefan hon yn cydymffurfio'n rhannol â safon AA Canllawiau Hygyrchedd Cynnwys Gwe fersiwn 2.2",
    "nonCompliances": "a hynny oherwydd yr enghreifftiau o beidio â chydymffurfio a restrir isod.",
    "nonAccessibleContent": "Cynnwys anhygyrch",
    "nonAccessibleReason": "Mae'r cynnwys a restrir isod yn anhygyrch am y rhesymau canlynol.",
    "nonComplianceHeading": "Anghydymffurfio â'r rheoliadau hygyrchedd",
    "doesNotComply": "Nid yw'r wefan yn cydymffurfio am y rhesymau canlynol:",
    "nonComplianceReasons": [
      "Mae rhai o'r dolenni wedi eu harddangos fel URLs crai heb unrhyw destun hygyrch. 2.4.4 pwrpas dolen (mewn cyd-destun).",
      "Nid yw'r PDFs wedi'u hallgludo yn hygyrch. 1.3.1 gwybodaeth a pherthnasoedd.",
      "Rhai botymau â diffyg testun hygyrch. 2.4.4 diben (mewn cyd-destun).",
      "Mae rhai botymau yn cynnwys datgeliad amodol na chaniateir ar gyfer y math hwn o fotwm. 4.1.2 enw, rôl, gwerth"
    ],
    "fixTimeline": "Rydym yn bwriadu datrys y materion hyn yn gynnar yn 2026.",
    "replacePdf": "Mae'r tim yn bwriadu disodli'r PDF gyda chynnwys hygyrch",
    "statementPrep": "Paratoi'r datganiad hygyrchedd hwn",
    "statementDate": "Cafodd y datganiad hwn ei baratoi ar 14 Hydref 2025. Fe'i ddiweddarwyd diwethaf ar 14 Hydref 2025.",
    "testingDetails": "Cynhaliwyd y prawf gan aelod o dîm hygyrchedd digidol y Weinyddiaeth Gyfiawnder ym mis Mawrth 2025. Cafodd y tudalennau a ymwelwyd â nhw fwyaf eu profi yn defnyddio adnoddau profi awtomataidd gan ein tîm gwefan.",
    "futureAudit": "Caiff archwiliad pellach o'r wefan ei drefnu ar gyfer safon AA 2.2 WCAG yn gynnar yn 2026"
  },
  "contactUs": {
    "title": "Cysylltu â ni",
    "reportProblem": "I roi gwybod am broblem neu i awgrymu gwelliannau i'r gwasanaeth hwn, gallwch anfon e-bost at:",
    "onlyUseForFeedback": "Dim ond i roi adborth ar y gwasanaeth digidol y dylid defnyddio'r cyfeiriad e-bost hwn.",
    "cannotAnswerQuestions": "Ni allwn ateb unrhyw gwestiynau am gynlluniau trefniadau plant sydd wedi eu creu'n barod."
  },
  "privacyNotice": {
    "title": "Hysbysiad Preifatrwydd",
    "committedToSecurity": "Mae'r Weinyddiaeth Gyfiawnder (MoJ) wedi ymrwymo i ddiogelu a chadw eich gwybodaeth bersonol yn saff.",
    "describeHowAndWhy": "Mae'r hysbysiad hwn yn disgrifio sut a phryd y defnyddir gwybodaeth o'r fath gennym. Mae'r hysbysiad preifatrwydd hwn yn disgrifio sut rydym yn casglu ac yn defnyddio gwybodaeth bersonol yn ystod ac ar ôl eich perthynas â ni, yn unol â chyfraith diogelu data. Caiff yr hysbysiad hwn ei ddiweddaru'n rheolaidd.",
    "typesOfPersonalData": "<h2 class=\"govuk-heading-m\">Math o ddata personol rydym yn ei brosesu</h2><p>Ar hyn o bryd rydym yn casglu ac yn defnyddio'r wybodaeth ganlynol:</p><ul class=\"govuk-list govuk-list--bullet\"><li>enw cyntaf y ddau riant neu ofalwyr</li><li>enwau cyntaf pob plentyn</li></ul><p>Rydym yn casglu a phrosesu gwybodaeth sy'n ymwneud â chynllunio trefniadau plant i'ch helpu i greu cynllun trefniadau plant wedi'i addasu. Fodd bynnag, nid ydym yn casglu gwybodaeth sy'n eich adnabod yn bersonol (PII), fel enwau, cyfeiriadau neu fanylion cyswllt.</p><p>Gan nad ydym yn casglu gwybodaeth y gellir ei defnyddio i'ch adnabod chi, nid yw llawer o hawliau diogelu data yn berthnasol. Rydym yn eich annog i beidio cynnwys y math hyn o fanylion yn eich cynllun. Cyn belled nad ydych yn rhoi gwybodaeth na ofynnir amdani yn y gwasanaeth, nid ydym yn casglu digon o wybodaeth i wybod pwy ydych chi.</p><p>Gall y mathau o wybodaeth a gesglir gennym nad yw'n eich adnabod yn bersonol gynnwys:</p><ul class=\"govuk-list govuk-list--bullet\"><li>manylion cyffredinol am drefniadau plant, fel trefniadau a ffefrir a lleoliadau casglu</li><li>cyswllt a ffefrir gennych</li><li>rhyngweithiad defnyddwyr gyda'n platfform, gan gynnwys ymddygiad llywio a defnydd nodwedd, i wella ein gwasanaeth</li></ul>",
    "howWeGetPersonalData": "<h2 class=\"govuk-heading-m\">Sut rydym yn cael eich data personol a pham ei fod gennym</h2><p>Mae'r rhan fwyaf o'r wybodaeth bersonol rydym yn ei phrosesu yn cael ei darparu'n uniongyrchol gennych chi. Mae'r wybodaeth a ddarperir gennych yn cael ei defnyddio i lunio cynllun trefniadau plant y gallwch lawrlwytho a rhannu gyda'ch cyd-riant. Mae'r wybodaeth a ddarperir gennych yn caniatáu i ni drefnu'r cynllun yn seiliedig ar eich anghenion penodol, gan sicrhau ei fod yn adlewyrchu'r trefniadau a fwriedir gennych i'ch plant.</p><p>Mae casglu'r data hwn yn hanfodol i:</p><ul class=\"govuk-list govuk-list--bullet\"><li>bersonoli'r cynllun ar gyfer eich sefyllfa rhianta</li><li>sicrhau bod dogfen y cynllun wedi'i lawrlwytho a lunir gennych yn cynnwys yr holl fanylion sydd eu hangen arnoch i gefnogi eich trefniadau cyd-rianta</li><li>darparu fersiwn o'r cynllun i chi y gellir ei lawrlwytho er mwyn gallu cyfeirio ato a'i rannu</li></ul><p>Rydym ond yn casglu'r wybodaeth sy'n ofynnol i greu eich cynllun trefniadau plant ac nid ydym yn ei defnyddio at unrhyw ddiben arall heb eich caniatâd.</p><p>Nid ydym yn rhannu'r wybodaeth a ddarperir gennych gydag unrhyw sefydliad nac adran arall o'r llywodraeth. Defnyddir y manylion a roddir gennych i greu eich cynllun trefniadau plant ar gyfer creu eich dogfen cynllun wedi'i bersonoli i chi yn unig.</p><p>O dan Reoliad Diogelu Data Cyffredinol y DU (GDPR y DU), y seiliau cyfreithlon yr ydym yn dibynnu arnynt ar gyfer prosesu'r wybodaeth hon yw eich caniatâd chi. Gallwch dynnu eich caniatâd yn ôl ar unrhyw adeg. Y ffordd haws o wneud hyn yw dileu'r cwcis porwr. Mae yna wybodaeth am sut i wneud hyn <a href=\"https://www.aboutcookies.org/how-to-manage-and-delete-cookies\">yma</a>.</p><p>Os ydych eisiau gofyn i ni ddileu eich data cwcis, cysylltwch â ni.</p>",
    "howWeStorePersonalData": "<h2 class=\"govuk-heading-m\">Sut rydym yn storio eich data personol</h2><p>Personal data is stored only while you create your plan and for up to 30 days afterwards.</p>",
    "howToComplain": "<h2 class=\"govuk-heading-m\">Sut i gwyno</h2><p>Os oes gennych unrhyw bryderon am ein defnydd o'ch data personol, gallwch gysylltu â swyddog diogelu data'r MoJ:</p><div class=\"govuk-inset-text\">Data Protection Officer<br />Ministry of Justice<br />10th Floor, Post Point 10.31<br />102 Petty France<br />London<br />SW1H 9AJ <br /><br /><a href=\"mailto:dpo@justice.gov.uk\">dpo@justice.gov.uk</a></div><p>Gallwch hefyd gwyno i'r ICO os ydych yn anhapus gyda sut rydym wedi defnyddio eich data.</p><div class=\"govuk-inset-text\">Swyddfa'r Comisiynydd Gwybodaeth<br />Wycliffe House<br />Water Lane<br />Wilmslow<br />Swydd Gaer<br />SK9 5AF<br /><br />Rhifau llinellau cymorth: 0303 123 1113<br />Gwefan ICO:<a href=\"https://www.ico.org.uk\">https://www.ico.org.uk</a></div>",
    "preparedDate": "Cafodd y datganiad hwn ei baratoi ar 7 Ionawr 2026."
  },
  "termsAndConditions": {
    "title": "Telerau ac amodau",
    "agree": "Trwy ddefnyddio'r gwasanaeth hwn rydych yn cytuno i'r telerau ac amodau hyn.",
    "responsibilityForTheServiceHeading": "Cyfrifoldeb am y gwasanaeth",
    "accurateAndComplete": "Y Weinyddiaeth Gyfiawnder sy'n cynnal y gwasanaeth hwn. Rydym yn ceisio sicrhau bod yr wybodaeth a ddarperir gennym yn gywir ac yn gyflawn a bod y gwasanaeth bob amser ar gael a heb firysau.",
    "noLiabilityFor": "Nid yw'r Weinyddiaeth Gyfiawnder yn derbyn unrhyw gyfrifoldeb:",
    "unableToAccess": "os nad ydych yn gallu cael mynediad i'r gwasanaeth (er enghraifft oherwydd galw mawr neu oherwydd ein bod wedi'i atal ar gyfer gwaith cynnal)",
    "indirectDamages": "niwed anuniongyrchol sy'n codi drwy ddefnyddio'r gwasanaeth neu'n dibynnu ar y cynnwys",
    "externalSites": "cynnwys ac argaeledd gwefannau allanol â dolenni i'r gwasanaeth neu o'r gwasanaeth",
    "informationAboutYouHeading": "Gwybodaeth amdanoch chi a'ch ymweliadau â'r wefan",
    "informationAboutYou": "Rydym yn casglu gwybodaeth amdanoch yn unol â'n <a href={{ privacyUrl }}>polisi preifatrwydd</a> a'n <a href={{ cookieUrl }}>polisi cwcis</a>. Drwy ddefnyddio'r gwasanaeth hwn rydych yn cytuno i ni gasglu'r wybodaeth hon a chadarnhau bod unrhyw ddata a ddarperir gennych yn gywir.",
    "limitationsHeading": "Cyfyngiadau'r gwasanaeth",
    "limitations": "Nid yw defnyddio'r gwasanaeth hwn yn gwarantu y gallwch ddatrys eich trefniadau plant ar y gwasanaeth neu heb fynd i'r llys. Tra bod yr adnodd hwn wedi'i ddylunio i'ch helpu i greu cynllun trefniadau plant, bydd rhai achosion angen eu datrys mewn ffyrdd eraill, efallai drwy fynd i'r llys.",
    "notLegallyEnforceable": "Nid yw unrhyw drefniant a gyrhaeddir gennych drwy'r gwasanaeth hwn yn cael ei orfodi'n gyfreithiol mewn llys. Mae hyn yn golygu nad oes unrhyw ofyniad cyfreithiol i chi na'r rhiant neu ofalwr arall gydymffurfio gyda'r hyn y cytunwyd arno gennych.",
    "misuseHeading": "Camddefnyddio",
    "misuse": "Ni ddylech ddynwared unrhyw berson arall, darparu gwybodaeth ffug neu gamarweiniol na defnyddio'r gwasanaeth hwn ar ran rhywun arall heb eu caniatâd.",
    "restrictionsOnUseHeading": "Cyfyngu ar ddefnyddio",
    "restrictionsOnUse": "Os oes gennych orchymyn llys mewn lle sy'n cyfyngu eich cysylltiad gyda'r rhiant arall neu'r plentyn, fel gorchymyn dim cyswllt, gorchymyn rhag molestu neu unrhyw gyfyngiad cyfreithiol arall, ni ddylech ddefnyddio'r gwasanaeth hwn i gysylltu â nhw. Gall gwneud hynny dorri'r gorchymyn a gall olygu canlyniadau cyfreithiol. Os ydych yn ansicr pa un a yw unrhyw orchymyn llys neu gyfyngiad cyfreithiol arall yn effeithio ar eich gallu i ddefnyddio'r gwasanaeth hwn, dylech ofyn am gyngor cyfreithiol cyn parhau."
  }
}
